{
	"entry": [
		{
			"date": "2018-02-17T08:23:45-08:00",
			"title": "A Blind Pig",
			"content": "Night has fallen. Restaurants are closing for the night. We walk towards the front door of an unassuming sandwich shop. A man at the door inspects a dimly lit list for our names. He stamps the missus’ hand then mine with a black illegible blob of ink and waves us along. There’s a young lady behind the counter offering bitesize desserts and glasses of bubbly. She was likely delivering a ham and swiss across the same counter a few hours earlier, now it is champagne and shortcakes. She directs us past the register and down a corner stairway. We proceed as instructed and as we turn into the basement, the room is full of life. The bar is crowded and all but two tables in front of the stage are occupied. We sit and sip. The stage is lit. Piano, drums, guitar, bass, and mics all waiting to come to life. The music fades as the band takes stage and an explosion of fun ensues.There is something exciting about a speakeasy. A time when people would pay to see a blind pig in exchange for a complimentary drink. Those days are mostly gone but the spirit remains. I’m happy to report that the blind pig has been replaced by great music and laughter. Cheers to the good times!",
			"image": "img/a-blind-pig.jpg"
		},
		{
			"date": "2018-01-14T06:14:43-08:00",
			"title": "Snow Day",
			"content": "The morning excitement of sliding out of bed and into bed side flip-flops is long gone. Many moons ago that was my ritual. A ritual that, early on, included salt water and sand. Thirty years later, I have traded flip-flops for powder clogs, sand for snow, and a boogie board for a sled.Throughout my childhood, I heard tales of children waking to snow covered streets and school cancellations. The closest thing to a snow day in my world was when schools closed because of hurricanes or storms. It only happened occasionally and within the first couple of months of a school year during hurricane season. Nowadays, I watch a daily ticker scroll across the morning news listing the school closings in the region. I imagine hundreds of kids receiving the news and cheering as they start their days. I recently experienced my first snow day as a ‘work from home’ day. Hours passed sitting at my bay window desk watching the weather shift from rain to freezing rain to snow. By afternoon, the storm had settled to snow and the kids were coming out to play. I watched a family walk towards the park to play in the snow. Dad ran his gloves across the retaining wall ledge and packed a snowball. He tossed it at his son and the boy followed suit. After watching the kids walk to the park all day, I glanced over at the sled the missus had given me for Christmas. I never wondered how a maiden voyage would feel for a forty year old sledding virgin, but it seemed to be the perfect time to discover the answer. Daylight was gone and the kids home for the night. I suited up and headed to the park with my bright orange sled in tow. My youthful excitement bubbled with each step closer. Upon arrival, I quickly realized I was in uncharted waters. I inspected my sled and considered the physics of the situation; calculating the coefficient of friction and slope estimation of the snow covered hill. The missus recognized my pause and shouted, “Okay, go! …just jump on it and push your body weight down the hill!” I obeyed the commands and started sliding carefree down the hill. Oh what joy! The sled whispered as I traveled down the hill, smile frozen on my face. All is right with the world. Playground in my path! I lean left to keep my run going as long as possible. The sled slips out. I slide and roll down the hill, laughing the whole time. I often hear people say, “You’re only as old as you feel inside.” Well, sometimes I feel like I’m eight years old but that doesn’t mean I want to go through junior high again. It really just means I wound’t mind having a few more snow days.",
			"image": "img/snow-day.jpg"
		},
		{
			"date": "2018-01-08T18:01:05-08:00",
			"title": "First Freeze",
			"content": "Driving on the highway, I take notice of the wind. The unseen element transitions into view as small particles lift in its wake. The patterns and path of the winds become apparent as the salt and snow take its shape. Like serpents slithering along the asphalt, I see the wind in motion and stillness. I walk through the park with the grass crackling beneath my shoes. Rubber sole to frozen soil, so foreign to me. Winter brings a deep sleep to the earth. I wonder how anything survives through this unrelenting cold. Skaters glide across a frozen pond. I watch in disbelief thinking of the awful stories I have heard about ice breaking and hypothermia. Families are playing hockey. I skated once or twice many years ago at an ice rink in Florida but never imagined it under blue skies surrounded by trees and rolling hills. I can’t contain the excitement. I trepidatiously step on to the frozen water. I see clearly through the ice to the bottom along the edge of the pond. As I walk out further towards the center, I gain more confidence and quicken my pace to build momentum. My heart races and a smile takes shape as I stop in place and my boots glide over the ice. I feel out the balance and repeat over and over again. This is happiness. So many complaints about shoveling snow and scraping windshields, but no one ever bothered to mention what it feels like to slide across the ice. It certainly is frustrating to have frozen washer fluid and dirty windshields but I would trade it any day for the joy of gliding boots across a frozen pond.",
			"image": "img/first-freeze.jpg"
		},
		{
			"date": "2017-12-31T18:00:35-08:00",
			"title": "The Eve of a New Year",
			"content": "It is New Year’s Eve. A time to reflect on the year that has passed and also a time to celebrate the start of a new calendar. As I slip a Lil’ Darlin into a koozie, pop the top, and sit down to write, I land squarely in the middle. It has been a roller coaster ride of a year that has taken me from the lowest of lows to the highest of highs. These experiences, although common occurrences, were unimaginable to me twelve months ago. We humans are terrible at predicting our own futures. So many hours daydreaming about life and calculating outcomes but this past year has proven that I will never know what is to come. As I take a sip from my beer, I reminisce about the friends and family that I have left behind and wonder what this new year will bring. I have discovered many things this year. The most impactful discovery is that there is always something wonderful to discover. It can be small and simple or treacherous and scary. Whatever the case, life is full of amazing experiences that we all share and view from our own perspective. I love life and I will not be shy about it. As we creep towards midnight and the countdown that leads to it, I raise my drink with joy and excitement. Cheers to the past and cheers to the future!",
			"image": "img/"
		},
		{
			"date": "2017-12-18T10:48:24-08:00",
			"title": "Home.",
			"content": "I travel to the great north across the border. As I cross the bridge, through the snow, I take a moment and smile, “How can this adventure endlessly surprise me?”. Six months ago, I could not imagine driving a rental car across a bridge to Canada but here I am. I feel confident steering through the light layer of slushy snow. All the youthful bike trails have trained me for this moment. The tires occasionally slip but I instinctively correct and fit in with the local traffic. A week of navigating through snow to and from the office, I am still in awe. So much that is foreign to me, presented like a script. The return across that bridge brought me right back to the excitement ahead. I never know what is to come but I know that there is always more. I arrive at Detroit Metro to board a plane home. The plane circles above Louisville as I peer over the wing down to the river. I exit the airport and walk through the sliding doors. The missus parks at the curb and the feeling pours over me. Home. It just happened. It took exactly thirty days of living here to cultivate this new feeling. I am home.",
			"image": "img/home.jpeg"
		},
		{
			"date": "2017-12-10T16:42:10-08:00",
			"title": "First Snow",
			"content": "It is a grey morning. I gather the loads and collect the detergent. The time has come to head to the local Laundry Mart. On my way towards the car, I see the white flakes. Could it be true? Yes, the news forecast stated a possible chance for snow. I drop the basket and supplies, turning towards the front porch to call for the missus. She had followed me out and was standing in the doorway. Declaring the obvious, as excitement leads one to do, I shout, “IT’S SNOWING! IT’S SNOWING!!”. Head tilted back, mouth agape to the sky, catching snowflakes on my tongue, it is a cinematic moment. A woman walking two dogs makes her way up the hill and sees me spinning in the walkway, arms wide, and gazing to the sky. I erupt at her with joy, “IT’S SNOWING! IT’S SNOWING!!”. Her face lights up with a smile as she responds by raising her arms to the sky and echoing, “IT’S SNOWING! IT’S SNOWING!!”. The flakes are so quiet as they dance their way to the ground. The wind becomes visible when the patterns form in midair. A most wondrous day and I am on top of the world. I finally settle down and refocus on the task at hand, laundry. I cannot break this smile, it is starting to hurt. Staring through the Laundry Mart window, I am still in disbelief. Watching nature’s calendar unfold is truly spectacular. There is a childlike joy burning inside keeping me warm. If ever I waver and that fire burn low, might I remember this very first snow.",
			"image": "img/first-snow.jpg"
		},
		{
			"date": "2017-12-03T18:47:59-08:00",
			"title": "First Frost with a Super Moon on the Side",
			"content": "I lived in a predictable weather pattern, knowing what to expect when stepping out for the day. The only question about the weather was “Will it rain today?”. Now, I find myself checking the weather constantly. Giddy like a child, waiting for ice, fog, sleet, snow, wind, and rain. I woke up and started my day as usual. Checking the temperature to calculate how many layers would be required to walk the dogs this morning. I consider how cold it was during last night’s walk and subtract a few degrees. Then a few more for being Florida blooded. Next, I spot a local walking his dog, compare how many layers he has on, and decide that I need one more. Ultimately, I wear the same thing every morning but calculating the expectation makes sunrise pretty fun. I notice a sparkle on the grass, the street light is catching the morning dew at a perfect angle. I start my car and turn on the wipers to clear the windshield. The wipers stumble across and back but they do not succeed. The dew is frozen. I make quick work of it, first time using a scraper. Off to work, over the hill, into a foggy lane. Visibility is low but I get to work invigorated. The cycle continues to surprise me, another day and another first. First frost with a super moon on the side.",
			"image": "img/First-Frost-with-a-Super-Moon-on-the-Side.jpeg"
		},
		{
			"date": "2017-11-26T12:47:11-08:00",
			"title": "Fat Bottomed Squirrels",
			"content": "Squirrels have always been a nuisance to my father. He would see squirrels nibbling on the fruit of his trees. My father would bark and squawk until the squirrels scampered off. He was always willing to share the bounty. If only the squirrels would finish what they started; instead of taking a few bites from each fruit and then moving on to the next. The mangoes and avocados which grew in our backyard were always lightly chewed. My father never had a squirrel friend. The trees are different here in Louisville. I do not recognize them. I peer through the window and see a local squirrel. He is heavier than the ones from my past and I watch him closely as he hops from the fence to the trash bin, and then straight up a tree trunk. He is surprisingly spry for having such a plump bottom. I suppose the squirrels in these parts load up in the fall and add a few extra pounds to prepare for the winter. I am certain he has been stashing acorns for the coming months around the neighborhood . I pour some honey into a cup of tea and begin to stir when a furry blur catches my eye through the kitchen window. I see my new squirrel friend hop on the window ledge and start to nibble on something. His back is turned and I can’t see what it is. I imagine he is rotating some kind of nut and nibbling his way around it. I have not seen any mangoes around these parts, so I am intrigued by his diet. I take a few steps towards the window to get a better view but I move too quickly and startle him. He drops his morning treat and disappears into the trees. Upon inspection, I see a lasagna noodle curled on the ledge. I think this is odd and step outside to remove the food and notice that the next window over has a some leftover fried chicken on the ledge. Is this Louisville squirrel living on a diet of lasagna and Kentucky Fried Chicken? This would explain my furry friend’s shape. I’ve since noticed some odd food items around the exterior of my home: a water cracker on the window ledge and a Dorito chip neatly placed on the corner of my mail box. I also noticed that the garbage carts have holes chewed through the lids so the squirrels can get in and out swiftly. Nature offers us gifts. Sometimes they are gifts in the form of entertainment. We need only be open to the details around us in order to enjoy them. I contemplated cleaning up after my squirrel friend but I have learned that he will always return and clean up after himself. It may take a few days but he will get to it. Some may consider this a nuisance but I consider it a gift. A simple reminder that fat bottomed squirrels need love too. Happy Birthday from Lou to me.",
			"image": "img/fat-bottomed-squirrels.jpeg"
		},
		{
			"date": "2017-11-19T10:26:27-08:00",
			"title": "Louisville I Greet You",
			"content": "When I first moved to Florida, we had one tree that would lose its leaves in autumn. I remember helping my father rake those leaves and then jumping into the pile before bagging them. It only happened for a few years but it is one of my earliest memories. I haven’t raked leaves since then but the cycle will now begin again. I have arrived in Louisville as autumn is coming to an end. Winter will be here soon. Over rolling hills, from the south, I am here now. Louisville is a remarkable gem of a city. It could be a honeymoon phase, but I think I’m in love. She has a subtle wink and a humble sparkle that makes me smile. I feel as if I am living in a movie that is set in a more perfect America, kind hearted friendliness and all. I tend to wonder what took so long to get here but then I recognize that I am where I need to be and it took exactly the right amount of time to get here. What’s to come? I do not know but Louisville I welcome you with open arms as you have done for me.",
			"image": "img/louisville-i-greet-you.jpeg"
		},
		{
			"date": "2017-11-12T08:58:56-08:00",
			"title": "Goodbye Big Water",
			"content": "Tides roll in, then recede. This is a natural cycle that sustains life. It is nature’s way of breathing. Miami’s name comes from a Native American Indian word meaning “big water”. “Miami” is what the original South Florida natives called the area’s river that cuts through to the ocean. The Miami River is the river that the city was built around. A river that is now overshadowed by nightlife in South Beach and Wynwood. Boxes are packed. Plans have been made. I now leave from one city on a river to another. Another river, named by another tribe of American Indians. The Ohio River will be my new water. The rolling waters poised to sustain life and reinvigorate the weary. I shall greet you soon…",
			"image": "img/goodbye-big-water.jpeg"
		},
		{
			"date": "2017-11-05T08:58:56-08:00",
			"title": "Kentucky Bluegrass",
			"content": "I was once told that St. Augustine grass had been classified as a weed and not as a grass. It didn’t surprise me at the time; although I can’t confirm it to be true. As a child, my adventures on the lawn would always end with itchy limbs. I now recognize that nature speaks and it was screaming “Get off of me!”. I am relocating to Kentucky and leaving Florida’s St. Augustine blades behind. I remember some of my first experiences with the soft grasses of the north and always thought it was like being outdoors with wall to wall carpeting. I dreamed of lying in the lawn and not getting itchy, of picnics and naps in the parks, fall leaves and winter too. Soon, I will realize those dreams.\nIt is bittersweet to leave the city that houses a lifetime of friends and family, but I feel the call of adventure and new experiences. Like a plant that beckons repotting with nutrient rich soil, I will take root in a new culture and continue to grow. I feel welcomed and invited, lost but guided, eager to learn new things and create a new reality. Life is a wonderful thing if you let it be. Upward and onward from the Sunshine State to the Bluegrass State.-Kentucky, here I come!",
			"image": "img/kentucky-bluegrass.jpeg"
		},
		{
			"date": "2017-10-15T08:58:56-08:00",
			"title": "Cafecito in Miami",
			"content": "I’ve never been much of a coffee drinker but I occasionally partake in a cultural ritual known as cafecito in Miami. The basic concept is to whip sugar into a froth with a little espresso and then mix it in with the remainder of the espresso shot. It is officially known in the Cuban circuit as a colada, in case you’d like to order it at a walk up cafeteria window. This drink, akin to a caffeine version of nitro glycerine, is then shared in miniature coffee cups with surrounding friends and strangers alike.\nI woke up this morning and let the dogs out in the backyard. They’re usually pretty quiet but I heard some excitement coming from the side yard so I peaked through the window to find my neighbor with his toddler leaning on the fence playing with the dogs. I smiled and waved through the glass between us, then returned to the kitchen and proceeded to brew the sweet concoction. I gathered the delivery and walked around to the side yard with cups and brew in hand. I smiled and said, “cafecito?”. He smiled and responded, “Si, gracias.” We leaned on the fence and greeted the morning, miniature cups in hand.\nTruth be told, I don’t think we even know each others names. A little less than strangers, we are two hispanic men from different countries that would not normally drink this flavor of nectar in our native culture but Miami has changed this. We have both adopted this ritual and welcome the cafecito smile. I often see people arguing in heated discussions and then, someone walks up with “cafecito?” and everyone smiles with friendship and joy. Like a magic potion, that is Cafecito in Miami.",
			"image": "img/cafecito-in-miami.jpg"
		}
		]
}
